providersimulation/rts/trelloBugBookingRQ.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Header><BaseInfo xmlns="http://www.rts.co.kr/"><SiteCode>GOV0X-00</SiteCode><Password>123456a</Password><RequestType>NetPartner</RequestType></BaseInfo></Header><Body><CreateSystemBookingForGuestCount xmlns="http://www.rts.co.kr/"><SystemBookingInfoNetForGuestCount><LanguageCode>AR</LanguageCode><ClientCurrencyCode>USD</ClientCurrencyCode><BookingCode /><AdminCompCode>RTS32</AdminCompCode><GroupOrFit>F</GroupOrFit><NationalityCode>EU</NationalityCode><TravelerNationality>CO</TravelerNationality><SalesCompCode>GOV0X</SalesCompCode><SalesSiteCode>GOV0X-00</SalesSiteCode><SalesUserNo>819904</SalesUserNo><SalesUserId /><SalesUserName /><SalesUserGender /><SalesUserBirthday /><SalesUserHandPhone /><SalesUserCompPhone /><SalesUserHomePhone /><SalesUserEamil /><SalesEmpNo>819904</SalesEmpNo><SalesEmpName /><SalesPayStatusCode /><NormalRemarks /><SalesRemarks /><AdminRemarks /><AdminBlockYn>false</AdminBlockYn><BookingPathCode>PATH01</BookingPathCode><CardPaymentYn>false</CardPaymentYn><CardPaymentAmount /><LastWriterUno>819904</LastWriterUno><CustomerList><CustomerInfo><No>1</No><Name>Jenny Perdomo</Name><LastName>Perdomo</LastName><FirstName>Jenny</FirstName><Gender>F</Gender><Age>0</Age><Country /><Birthday /><JuminNo /><LeadYn>false</LeadYn><PassportNo /><PassportExpiry /></CustomerInfo></CustomerList><BookingHotelList><BookingHotelInfo><ItemCode>LAX0240</ItemCode><ItemNo>15</ItemNo><AgentBookingReference>1053640</AgentBookingReference><BookerTypeCode>Partner</BookerTypeCode><BookingPathCode>PATH01</BookingPathCode><AppliedFromDate>2019-11-15</AppliedFromDate><AppliedToDate>2019-11-17</AppliedToDate><RoomTypeCode>200084513|200493214|82fc33ba-6267-43a0-96f7-3f9b408e7d10-5100-024|Standard Room 1 King Bed Non Smoking|ZENRTB|SB1:TB0:TR0:QD0:CSB0:CTB0:CTR0:CQD0:CSBNUM0:CTBNUM0:CTRNUM0:CQDNUM0:AGE0:AGE0:AGE0:AGE0:FV0:SX0:SV0:EG0|DQRBA|U|US|full breakfast|ZJGRKFMJMG|~Full Breakfast</RoomTypeCode><FreeBreakfastTypeName>FULL BREAKFAST</FreeBreakfastTypeName><AddBreakfastTypeName /><VatSheetYn>false</VatSheetYn><GuestCountAndGuestList><GuestCountAndGuestInfo><RoomNo>1</RoomNo><AdultCount>1</AdultCount><ChildCount>0</ChildCount><GuestList><GuestInfo><GuestNo>1</GuestNo><AgeTypeCode /><ProductId /></GuestInfo></GuestList></GuestCountAndGuestInfo></GuestCountAndGuestList></BookingHotelInfo></BookingHotelList><SellerMarkup>*1</SellerMarkup></SystemBookingInfoNetForGuestCount></CreateSystemBookingForGuestCount></Body></Envelope>